{"backend": "tensorflow", "config": [{"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "strides": [1, 1], "activation": "relu", "filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_38", "dtype": "float32", "kernel_size": [3, 3], "activity_regularizer": null, "batch_input_shape": [null, 128, 128, 3]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_38", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_39", "activation": "relu", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_39", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_20", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_39", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_40", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}