{"keras_version": "2.2.2", "config": [{"config": {"padding": "valid", "name": "conv2d_99", "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "batch_input_shape": [null, 128, 128, 3], "trainable": true, "filters": 16, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_98", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "name": "conv2d_100", "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "filters": 96, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_99", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "name": "conv2d_101", "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "filters": 96, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_100", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_49", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_97", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_98", "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}