{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 32, 32, 3], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "filters": 16, "activation": "relu", "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_15", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_15", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "relu", "units": 128, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_29", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "activation": "softmax", "units": 4, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_30", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}