{"config": [{"config": {"padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "activation": "relu", "dtype": "float32", "bias_constraint": null, "use_bias": true, "name": "conv2d_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "use_bias": true, "name": "conv2d_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "units": 128, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "units": 5, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}