{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_5", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_5", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_6", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_3", "kernel_constraint": null, "units": 128, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_4", "kernel_constraint": null, "units": 5, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}], "backend": "tensorflow"}