{"config": [{"config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "padding": "valid", "kernel_constraint": null, "filters": 16, "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_3", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "padding": "valid", "kernel_constraint": null, "filters": 16, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_4", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_4", "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}