{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "trainable": true, "kernel_constraint": null, "filters": 16, "name": "conv2d_5", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_5", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 16, "name": "conv2d_6", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_6", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 128, "trainable": true, "kernel_constraint": null, "name": "dense_5", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 5, "trainable": true, "kernel_constraint": null, "name": "dense_6", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}